Tekla.Structures.Drawing.ScalingOptions
The options for controlling the scaling of the objects in the drawing.

Tekla.Structures.Drawing.ScalingOptions.NoScaling
Does not scale the object.

Tekla.Structures.Drawing.ScalingOptions.ScaleToFit
Scales the object to fit in the frame in the Y direction.